other_test_shell/jmx/inserttitle_100.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.6" jmeter="2.11 r1554548">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="inserttitle_100" enabled="true">
      <stringProp name="TestPlan.comments">insert title date to pbo title interface</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="100users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1403680380000</longProp>
        <longProp name="ThreadGroup.end_time">1403680380000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="pbo_titles" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[&#xd;
{&#xd;
    &quot;titleId&quot;:&quot;ObjectId&quot;,&#xd;
    &quot;title&quot;:&quot;中国合伙人&quot;,&#xd;
    &quot;language&quot;:&quot;zh-CN&quot;,&#xd;
    &quot;country&quot;:&quot;CN&quot;,&#xd;
    &quot;publishDate&quot;:2000,&#xd;
    &quot;category&quot;:&quot;电影&quot;,&#xd;
    &quot;subcategory&quot;:[&#xd;
        &quot;动作&quot;,&#xd;
        &quot;爱情&quot;&#xd;
    ],&#xd;
    &quot;directors&quot;:[&#xd;
        &quot;陈可辛&quot;&#xd;
    ],&#xd;
    &quot;actors&quot;:[&#xd;
        &quot;黄晓明&quot;,&#xd;
        &quot;邓超&quot;,&#xd;
        &quot;佟大为&quot;&#xd;
    ],&#xd;
    &quot;guests&quot;:[&#xd;
        &quot;思琦&quot;,&#xd;
        &quot;王滔&quot;,&#xd;
        &quot;凌晗&quot;&#xd;
    ],&#xd;
    &quot;hosts&quot;:[&#xd;
        &quot;华少&quot;,&#xd;
        &quot;朱丹&quot;,&#xd;
        &quot;伊一&quot;&#xd;
    ],&#xd;
    &quot;content&quot;:&quot;简介&quot;,&#xd;
    &quot;tags&quot;:[&#xd;
        &quot;励志&quot;,&#xd;
        &quot;热血&quot;&#xd;
    ]&#xd;
}&#xd;
]</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">192.168.1.205</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">30000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/pbo/titles</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="http_head_manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>